module.exports = {
  messagelist: [
    { type: -1, message: "我冷！😭" },
    { type: 1, message: "哦，那跑跑就暖和了" },
    {
      type: -1,
      message: "离谱",
    },
    { type: 1, message: "就是冻死那个？😂" },
    { type: -1, message: "我冷！😭" },
    { type: 1, message: "哦，那跑跑就暖和了" },
    {
      type: -1,
      message: "离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱",
    },
    { type: 1, message: "就是冻死那个？😂" },
    { type: -1, message: "我冷！😭" },
    { type: 1, message: "哦，那跑跑就暖和了" },
    {
      type: -1,
      message: "离谱",
    },
    { type: 1, message: "就是冻死那个？😂" },
    { type: -1, message: "我冷！😭" },
    { type: 1, message: "哦，那跑跑就暖和了" },
    {
      type: -1,
      message: "离谱",
    },
    { type: 1, message: "就是冻死那个？😂" },
    { type: -1, message: "我冷！😭" },
    { type: 1, message: "哦，那跑跑就暖和了" },
    {
      type: -1,
      message:
        "离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱离谱",
    },
    { type: 1, message: "就是冻死那个？😂" },
    { type: -1, message: "我冷！😭" },
    { type: 1, message: "哦，那跑跑就暖和了" },
    {
      type: -1,
      message: "离谱",
    },
    { type: 1, message: "就是冻死那个？😂" },
    { type: -1, message: "我冷！😭" },
    { type: 1, message: "哦，那跑跑就暖和了" },
    {
      type: -1,
      message: "离谱",
    },
    { type: 1, message: "就是冻死那个？😂" },
    { type: -1, message: "我冷！😭" },
    { type: 1, message: "哦，那跑跑就暖和了" },
    {
      type: -1,
      message: "离谱",
    },
    { type: 1, message: "就是冻死那个？😂" },
    { type: -1, message: "我冷！😭" },
    { type: 1, message: "哦，那跑跑就暖和了" },
    {
      type: -1,
      message: "离谱",
    },
    { type: 1, message: "就是冻死那个？😂" },
  ],
};
