exports.informed =

`
智慧农业综合服务云平台隐私政策\n
您好，欢迎来到智慧农业综合服务云平台。

本《隐私政策》适用于我们提供的一切智慧农业综合服务云平台服务。当您使用我们任何单项服务时，您同意接受本《隐私政策》以及我们在该单项服务中发出的特定隐私信息类政策条款（下列称“特定条款”）的保护，在此情况下特定条款与本政策条款同时对您产生效力。如特定条款与本《隐私政策》条款存在同类条款的不一致约定，则在特定条款约束范围内应以特定条款为准。如我们提供的某一单项服务不适用本《隐私政策》的，我们在该服务中会以适当方式明示排除适用本《隐私政策》。

请注意我们不时地会检查我们的政策，因此有关的措施会随之变化。我们恳请您定期光顾本页面，以确保对我们《隐私政策》最新版本始终保持了解。

如果您使用或继续使用智慧农业综合服务云平台服务，这都表示您同意我们按照本《隐私政策》收集、使用、储存和分享您的信息.

希望您仔细阅读《隐私政策》（以下简称“本政策”），详细了解我们对信息的收集、使用方式，以便您更好地了解我们的服务并在是否选择服务以及选择何种服务时更加符合您的真实意思表示。

本隐私政策将帮助您了解以下内容：

1.我们如何收集和使用您的个人信息

2.我们如何共享、转让、公开披露您的个人信息

3.我们如何保护您的个人信息

4.您如何管理您的个人信息/您的权利

5.我们如何处理未成年人的个人信息

6.存储信息的地点和期限，您的个人信息如何在全球范围转移

7.本隐私政策如何更新

8.广告/我们向您发送的信息

9.适用范围

10.其他 

1、我们如何收集和使用您的个人信息

我们会根据合法正当、必要、透明的原则，基于本政策所述的目的，收集和使用您的个人信息。如果我们将您的个人信息用于本政策未载明的其它用途，或基于其他特定目的而收集您的个人信息，我们将以合理的方式告知您，并在使用前再次征得您的同意。

为实现我们的基本业务功能，我们需要向您收集以下个人信息，若您拒绝提供，我们将无法向您提供相应的服务。我们会出于本政策所述的以下目的，收集和使用您的个人信息：

我们将向您提供下列服务，并在提供下列服务时分别收集如下所列的信息：

1）业务功能：当你注册成为我们用户。我们会基于您提供的手机号码向您发送短信验证码，用于验证您的身份。

为保障平台安全和运营安全，我们会申请系统权限收集手机号码、IMEI、IMSI、本机应用安装列表等设备信息用于平台安全风控，收集这些信息是为了帮助我们进行bug分析、反作弊等安全保护工作，保障您正常使用本产品与/或服务、改进和优化我们的产品体验、保障您的账号安全。同时，除本政策另有明确约定外，我们不会将您的设备信息提供给任何第三方

手机号码属于敏感信息，收集此类信息是为了满足国家法律法规的网络实名制要求以及完成智慧农业综合服务云平台账号的注册。

若您不提供这类信息，您可能无法正常使用我们的服务。

您提供的上述信息，将在您使用本服务期间持续授权我们使用。我们会一直保存您的信息直至您注销账号。在您注销账号时，我们将停止使用并删除上述信息。

上述信息仅存储于中华人民共和国境内，如需跨境传输，我们将会单独征得您的授权同意。

2）业务功能：社区。当您使用社区服务时，我们没有要求您必须提供的信息。

在使用过程中，如果您提供以下额外信息，将有助于我们给您提供更好的服务和体验：个人位置信息。但如果您不提供这些信息，将不会影响使用本服务的基本业务功能。

个人位置信息属于敏感信息。

您提供的上述信息，将在您使用本服务期间持续授权我们使用。我们会一直保存您的信息直至您注销账号。在您注销账号时，我们将停止使用并删除上述信息。

上述信息仅存储于中华人民共和国境内，如需跨境传输，我们将会单独征得您的授权同意。

3）业务功能：发布UGC内容。当您使用发布UGC内容服务时，为提供UGC的素材，您需要提供以下功能、信息供我们收集：相册权限、摄像头权限、个人位置权限。

若您不提供这类信息，您可能无法正常使用发送社区动态的服务。

在使用过程中，如果您提供以下额外信息，将有助于我们给您提供更好的服务和体验：个人位置信息。但如果您不提供这些信息，将不会影响使用本服务的基本业务功能。

个人位置信息属于敏感信息。

您提供的上述信息，将在您使用本服务期间持续授权我们使用。我们会一直保存您的信息直至您注销账号。在您注销账号时，我们将停止使用并删除上述信息。

上述信息仅存储于中华人民共和国境内，如需跨境传输，我们将会单独征得您的授权同意。

4）设备信息访问权限

当您同意开启此项权限后，为了保护您的账户及登录安全，我们会收集您的相应设备信息，用于优化用户体验、安全排查、识别是否为常用设备、设备绑定情况

5）消息推送权限

当您同意开启此项权限后，我们会为您推送消息，便于您能够及时接收及了解我们发出的通知。如您拒绝此项授权，您将无法接收到我们为您推送的消息。

6）摄像头权限

当您同意开启此项权限后，我们会使用您设备上的相机拍摄功能。此项功能将用于实现照片拍摄、录制视频功能，并采集、识别上述功能实现过程中所拍摄或录制的图片及视频信息。如您拒绝该项授权，前述功能将无法使用。

7）智慧农业综合服务云平台App所调用的系统权限

如上所述，为了向您提供智慧农业综合服务云平台产品与/或服务，我们可能需要使用您设备中的系统权限（不包括所接入第三方调用的权限）来收集相关个人信息。尽管我们在前述章节中已经有所涉及，本节将对智慧农业综合服务云平台App所使用的所有系统权限进行归纳整理，以方便向您更加系统、完整、透明地呈现。您可以选择是否授权我们使用您设备的相关权限，如果您不授权我们使用相关权限，可能会导致部分服务无法使用，但是不影响您使用智慧农业综合服务云平台App的其他功能。

我们将按照前述的用途使用您的信息。当我们要将信息用于本政策未载明的其他用途时，会事先征得您的同意。当我们要将基于特定目的收集的信息用于其他目的时，会事先征得您的同意。

您可以通过我们的服务与您的其他用户分享您的相关信息。例如，您在社区中公开分享的文字和照片。

请注意，这其中可能包含您的个人身份信息、个人财产信息等敏感信息。请您谨慎考虑披露您的相关个人敏感信息。

您可以通过服务中的设置或我们提供的指引删除您公开分享的信息。但请您注意，这些信息仍可能由其他用户或不受我们控制的非关联第三方独立地保存。

收集、使用个人信息目的变更

我们可能随着业务的发展，会对产品有所调整。当新功能或服务与原上述业务功能使用场景相关时，收集与使用的个人信息属于与原目的具有直接关联。在与原目的无直接关联的场景下，我们收集、使用您的个人信息，会再次征得您的同意。

2、我们如何共享、转让、公开披露您的个人信息

共享

我们不会与智慧农业综合服务云平台服务提供者以外的公司、组织和个人共享您的个人信息，但以下情况除外：

1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息；

2、在法定情形下的共享：我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息；

3、与关联公司间共享：为便于我们基于关联账号共同向您提供服务，推荐您可能感兴趣的信息或保护智慧农业综合服务云平台关联公司或其他用户或公众的人身财产安全免遭侵害，您的个人信息可能会与我们的关联公司共享。我们只会共享必要的个人信息（如为便于您通过智慧农业综合服务云平台账号使用我们关联公司产品或服务，我们会向关联公司共享您必要的账户信息），如果我们共享您的个人敏感信息或关联公司改变个人信息的使用及处理目的，将再次征求您的授权同意；

4、与授权合作伙伴共享：仅为实现本隐私政策中声明的目的，我们的某些服务将由我们和授权合作伙伴共同提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。例如安排合作伙伴提供服务。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于与产品或服务无关的其他用途。

我们将信息发送给支持我们业务的供应商、服务提供商和其他合作伙伴，这些支持包括提供技术基础设施服务、分析我们服务的使用方式、衡量广告和服务的有效性、提供客户服务、支付便利或进行学术研究和调查。

对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的数据保护协定，要求其按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。

转让

我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：

1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；

2、在涉及合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。

公开披露

我们仅会在以下情况，公开披露您的个人信息：

1、获得您明确同意或基于您的主动选择，我们可能会公开披露您的个人信息；

2、如果我们确定您出现违反法律法规或严重违反智慧农业综合服务云平台相关协议规则的情况，或为保护智慧农业综合服务云平台及其关联公司用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或智慧农业综合服务云平台相关协议规则征得您同意的情况下披露关于您的个人信息，包括相关违规行为以及智慧农业综合服务云平台已对您采取的措施。

共享、转让、公开披露个人信息时事先征得授权同意的例外

以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：

1、与国家安全、国防安全有关的；

2、与公共安全、公共卫生、重大公共利益有关的；

3、与犯罪侦查、起诉、审判和判决执行等有关的；

4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；

5、您自行向社会公众公开的个人信息；

6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。

根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。

3、我们如何保护您的个人信息

为了保护您的信息安全，我们将严格遵守法律法规等规范性文件要求的技术措施和操作流程保护您的信息秘密，同时：

1.我们已采取符合业界通用解决方案、合理可行的安全防护措施保护您提供的个人信息安全，防止个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会使用加密技术提高个人信息的安全性；我们会使用受信赖的保护机制防止个人信息遭到恶意攻击；我们建立严格的内部控制制度，建立完善、充分的管理流程，我们会部署访问控制机制，尽力确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。

2.我们有行业先进的以数据为核心，围绕数据生命周期进行的数据安全管理体系，从组织建设、制度设计、人员管理、产品技术等方面多维度提升整个系统的安全性。

3.我们会采取合理可行的措施，尽力避免收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。

4.互联网并非绝对安全的环境，我们强烈建议您不要使用非智慧农业综合服务云平台推荐的通信方式发送个人信息。您可以通过我们的服务建立联系和相互分享。当您通过我们的服务创建交流、交易或分享时，您可以自主选择沟通、交易或分享的对象，作为能够看到您的交易内容、联络方式、交流信息或分享内容等相关信息的第三方。

如您发现自己的个人信息尤其是您的账户或密码发生泄露，请您立即联络我们，以便我们根据您的申请采取相应措施。

请注意，您在使用我们服务时自愿共享甚至公开分享的信息，可能会涉及您或他人的个人信息甚至个人敏感信息，如您在发表动态或者在群聊天、圈子等公众场合选择上传包含个人信息的图片。请您更加谨慎地考虑，是否在使用我们的服务时共享甚至公开分享相关信息。

请使用复杂密码，协助我们保证您的账号安全。我们将尽力保障您发送给我们的任何信息的安全性。

我们将按照法律法规的要求更新并公开安全风险、个人信息安全影响评估等报告的内容。

互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。

在不幸发生个人信息安全事件后，我们将依照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施，您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以推送通知的方式告知您，并采取合理有效的方式发送公告。

同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。

4、您如何管理您的个人信息/您的权利

按照中华人民共和国相关的法律、法规、国家标准，以及行业通行做法，我们保障您对自己的个人信息行使以下权利：

1）访问、编辑您的个人信息

账户信息——如果您希望访问或编辑您的账户中的个人信息、设置隐私与权限、设置消息提醒与聊天、更改您的绑定手机号与密码、关闭您的账户等，您可以通过登录账号通过“我的”-“设置”执行此类操作。

个人资料——如果您希望访问或编辑您个人资料中的昵称、头像、出生年月日、以及其他资料，您可以通过登录账户通过点击“我的”个人ID名称或“编辑”执行此类操作。

动态信息——您可以登录账号通过“我的”，访问或清除您已发布内容的历史记录。

如果您无法通过上述路径访问该等个人信息，您可以随时通过智慧农业综合服务云平台客服与我们取得联系。我们将在15天内回复您的访问请求。

对于您在使用我们的产品或服务过程中产生的其他个人信息，我们将根据相关安排向您提供。

您可以通过与智慧农业综合服务云平台客服联系的方式，申请个人信息副本。

2）个人信息更正

当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正或补充。您可以通过本条“个人信息查询”中列明的方式提出更正或补充申请。

3）个人信息删除

您可以通过本条“个人信息查询”中列明的方式删除您的部分个人信息。

在以下情形中，您可以向我们提出删除个人信息的请求：

1、如果我们处理个人信息的行为违反法律法规；

2、如果我们收集、使用您的个人信息，却未征得您的明确同意；

3、如果我们处理个人信息的行为严重违反了与您的约定；

4、如果您不再使用我们的产品或服务，或您主动注销了账号；

5、如果我们永久不再为您提供产品或服务。

若我们决定响应您的删除请求，我们还将同时尽可能通知从我们处获得您的个人信息的主体，要求其及时删除，除非法律法规另有规定，或这些主体获得您的独立授权。

当您从我们的服务中删除信息后，我们可能不会立即从备份系统中删除相应的信息，但会在备份更新时删除这些信息。

4）约束信息系统自动决策

在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将在不侵害智慧农业综合服务云平台商业秘密或其他用户权益、社会公共利益的前提下提供申诉方法。

5）响应您的上述请求

为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。

我们将在15天内做出答复。如您对我们的答复不满意，还可以通过智慧农业综合服务云平台客服发起投诉。

对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际的请求，我们可能会予以拒绝。

相关限制

在以下情形中，按照法律法规要求，我们将无法响应您的请求：

a、与国家安全、国防安全有关的；

b、与公共安全、公共卫生、重大公共利益有关的；

c、与犯罪侦查、起诉、审判和执行判决等有关的；

d、有充分证据表明个人信息主体存在主观恶意或滥用权利的；

e、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；

f、涉及商业秘密的。

5、我们如何处理未成年人的个人信息

我们的产品主要面向成年人，我们期望父母或监护人指导未成年人使用我们的服务，若您是未满18周岁的未成年人，在使用我们的产品前，应在您的父母或其他监护人监护、指导下共同阅读并同意本政策。如果没有父母或监护人的同意，儿童（不满14周岁）不得创建自己的用户账号。

我们根据国家相关法律法规的规定保护未成年人的个人信息，对于经父母同意而收集未成年人个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用、共享或公开披露此信息。

如果我们发现自己在未事先获得可证实的父母同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。

6、存储信息的地点和期限，您的个人信息如何在全球范围转移

个人信息存放的地域

我们严格按照法律法规的规定，将境内收集和产生的用户个人信息存放于中国境内。

个人信息出境的情况

我们在中华人民共和国境内运营中收集和产生的个人信息，存储在中国境内。如果在未来出现个人信息出境的情况，我们将严格遵守中华人民共和国法律法规的相关规定，同时对出境信息的信息安全进行评估，并获取您的明确授权，但是您通过互联网进行跨境发布动态等个人主动行为除外。

针对以上情形，我们会确保依据本隐私政策对您的个人信息提供足够的保护。

存储信息的期限

一般而言，我们仅在为实现目的所必需的最短时间内保留您的个人信息，超过相应期限内的个人信息将会删除或匿名化进行处理。但在下列情况下，我们有可能因需符合法律要求，更改个人信息的存储时间：

1.为遵守适用的法律法规或政策等规范性文件的有关规定；

2.为遵守行政机关或类似授权组织的决定等、司法机关判决、裁定、仲裁机关的裁决或其他法律程序的规定；

3.我们有理由确信需要遵守法律法规等有关规定；

4.为执行相关服务协议或本政策、维护社会公共利益，为保护们的客户、我们或我们的关联公司、其他用户或雇员等第三方的人身财产安全或其他合法权益所合理必需的用途。

当智慧农业综合服务云平台发生停止运营的情形时，我们将采取推送通知、网站或程序内公告等形式通知您，并在合理的期限内删除或匿名化处理您的个人信息。

7、本隐私政策如何更新

我们的隐私政策可能变更。如果发生业务功能变更、使用目的变更、个人信息保护相关负责人联络方式变更等情形，我们将相应修订隐私政策。

未经您明确同意，我们不会限制您按照本隐私政策所应享有的权利。对于重大变更，我们会提供显著的通知（包括我们会通过智慧农业综合服务云平台平台公示的方式、智慧农业综合服务云平台客服通知等进行通知）。

本政策所指的重大变更包括但不限于：

1）我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；

2）个人信息共享、转让或公开披露的主要对象发生变化；

3）您参与个人信息处理方面的权利及其行使方式发生重大变化；

8、广告/我们向您发送的信息

我们可能使用您的相关信息，在相关网站、应用、及其他渠道向您发送商业广告。

如果您不想接受我们给您发送的商业广告，您可随时通过相应产品退订功能取消。

9、适用范围

本隐私权政策适用于由智慧农业综合服务云平台提供的所有服务，但不适用于有单独的隐私权政策且未纳入本隐私权政策的第三方产品或服务。

10、其他

本“隐私政策”中的标题仅为方便及阅读而设，并不影响本《隐私政策》中任何规定的含义或解释。

本“隐私政策”的版权为我们所有，在法律允许的范围内，我们拥有解释和修改的权利。

`