<template>
    <div id="dashBoard">
        <div id="navigationSider">
            <template v-if="role=='farmer'">
                <div @click="navigationFunc('PlotManagement')" style="margin-top:120px">
                    <svg xmlns="http://www.w3.org/2000/svg"
                        class="styles__StyledSVGIconPathComponent-sc-16fsqc8-0 fPsHiw svg-icon-path-icon"
                        viewBox="0 0 1024 1024" width="30" height="30">
                        <defs data-reactroot=""></defs>
                        <g>
                            <path
                                d="M384 547.2H128a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64z m-21.333333 298.666667H149.333333v-213.333334h213.333334zM384 56.533333H128a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64z m-21.333333 298.666667H149.333333v-213.333333h213.333334zM597.333333 440.533333h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64H597.333333a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64z m21.333334-298.666666h213.333333v213.333333H618.666667zM727.466667 845.866667H618.666667v-213.333334h213.333333v107.733334a10.666667 10.666667 0 0 0 10.666667 10.666666h64a10.666667 10.666667 0 0 0 10.666666-10.666666v-133.973334a59.093333 59.093333 0 0 0-59.306666-59.093333h-264.533334A59.306667 59.306667 0 0 0 533.333333 606.293333v265.6a59.52 59.52 0 0 0 59.306667 59.306667h134.826667a10.666667 10.666667 0 0 0 10.666666-10.666667v-64a10.666667 10.666667 0 0 0-10.666666-10.666666z"
                                fill="#ffffff" p-id="1777"></path>
                            <path
                                d="M817.28 769.92a10.666667 10.666667 0 0 0-15.146667 0l-45.226666 45.226667a10.666667 10.666667 0 0 0 0 14.933333l134.4 134.4a10.666667 10.666667 0 0 0 14.933333 0L960 911.573333z"
                                fill="#ffffff" p-id="1778"></path>
                        </g>
                    </svg>
                    <div>
                        地块
                    </div>
                </div>
                <div @click="navigationFunc('TraceFarmer')">
                    <svg xmlns="http://www.w3.org/2000/svg"
                        class="styles__StyledSVGIconPathComponent-sc-16fsqc8-0 fPsHiw svg-icon-path-icon fill"
                        viewBox="0 0 1024 1024" width="35" height="35">
                        <defs data-reactroot=""></defs>
                        <g>
                            <path
                                d="M342.6 288c23.5 13.5 60.3 34.3 78.2 47.3l-33.9 45.9c-17-14-52.3-36.7-76.3-51.7l32-41.5z m316.1 155.5H549.9V470h108.8v-26.5z m-339.1-25.6c24 12.1 59.8 31.9 78.7 44.4l-33.9 46.3c-16.5-13.5-51.8-34.8-76.3-49.7l31.5-41z m339.1 90.7H549.9v27h108.8v-27z m-150.2 86.9l49.5 15c-14.6 34.3-36.7 74.3-54.2 99.5-10.4-8.7-31.6-21.7-43.8-28 18.3-22.8 36.7-56.1 48.5-86.5z m-148.9-52.1l46.2 31.4c-17.9 51.7-40 106.7-60.8 154.5l-51.4-30.9c19.4-37.7 46.2-99 66-155z m364.6-233.7v51.7h-138L639 371c-6.1 10.6-12.2 21.2-18.4 31.4h90v174.3h-82V681c0 24.6-3.8 38.1-20.3 45.9-16 7.7-38.2 8.7-66.9 8.2-2.4-15-8.5-35.2-14.6-49.2 9.4 0.3 19.6 0.4 27.7 0.4h13.3c5.2 0 7.1-1.5 7.1-6.8V576.7h-74.4V402.4h63.1c4.7-14 9-28.5 11.3-41H484V443c0 85.4-8.5 212.9-64.5 293-9.9-9.2-33.5-24.6-47.1-30.9 52.8-74.3 57.5-183.9 57.5-262.1V309.7h294.3zM800 720c26.5 0 48 21.5 48 48s-21.5 48-48 48-48-21.5-48-48 21.5-48 48-48z m0-72l-96 49.4v141.3l96 49.3 96-49.3V697.3L800 648zM512 128c-212.1 0-384 171.9-384 384s171.9 384 384 384c47.4 0 93.6-8.6 136.8-25.1-5.7-9.6-8.8-20.7-8.8-32.2V697.3c0-18.4 7.9-35.6 21.2-47.6-6-13-12.6-26.5-19.4-40.2l48.5-18.8c5.8 11.1 11.7 22.1 17.4 32.8l63-32.4c18.4-9.5 40.2-9.5 58.5 0l52 26.7 0.6-2.1c9.3-33.4 14.1-68.2 14.1-103.7 0.1-212.1-171.8-384-383.9-384z m0-64c247.4 0 448 200.6 448 448 0 47.2-7.3 93.4-21.5 137.4 13.4 12 21.5 29.3 21.5 47.9v141.3c0 24-13.4 46-34.7 56.9l-96 49.4c-18.4 9.5-40.2 9.5-58.5 0l-61.1-31.4c-1.7 1.2-3.5 2.3-5.4 3.2C644.7 945.1 579.4 960 512 960 264.6 960 64 759.4 64 512S264.6 64 512 64z"
                                p-id="2021" fill="#ffffff"></path>
                        </g>
                    </svg>
                    <div>
                        溯源
                    </div>
                </div>
                <div class="container">
                    <div @click="toggleCollapse()" class="item" style="margin-bottom:0">
                        <svg xmlns="http://www.w3.org/2000/svg"
                            class="styles__StyledSVGIconPathComponent-sc-16fsqc8-0 fPsHiw svg-icon-path-icon fill"
                            viewBox="0 0 1024 1024" width="33" height="33">
                            <defs data-reactroot=""></defs>
                            <g>
                                <path
                                    d="M822.529 878.171c16.521 0 29.914 13.393 29.914 29.915 0 16.52-13.393 29.914-29.914 29.914H185.77c-16.521 0-29.914-13.393-29.914-29.914 0-16.522 13.393-29.915 29.914-29.915h636.759zM806.464 105C885.184 105 949 168.875 949 247.669v375.08c0 78.793-63.816 142.668-142.536 142.668H199.536C120.816 765.417 57 701.542 57 622.75V247.67C57 168.875 120.816 105 199.536 105h606.928z m0 59.829H199.536c-45.252 0-82.02 36.35-82.752 81.47l-0.01 1.37v375.08c0 45.293 36.316 82.097 81.393 82.828l1.37 0.011h606.927c45.252 0 82.02-36.35 82.752-81.47l0.01-1.37v-375.08c0-45.293-36.316-82.097-81.393-82.828l-1.37-0.011z m-45.391 94.624c11.931 14.837 11.377 38.017-1.153 52.065l-0.383 0.423-178.78 194.045c-10.662 11.573-26.7 13.275-38.978 4.198l-0.371-0.279L432.9 427.25 291.713 603.972c-11.89 14.882-31.83 15.89-44.783 2.37l-0.39-0.414c-12.81-13.813-13.677-36.98-2.04-52.029l0.356-0.453 159.56-199.719c10.502-13.145 27.57-15.676 40.563-6.086l0.393 0.294 110.09 83.862L715.893 257.67c12.9-14.002 33.128-13.203 45.18 1.784z"
                                    p-id="9429" fill="#ffffff"></path>
                            </g>
                        </svg>
                        <div style="display: flex;">
                            <div>
                                数据分析
                            </div>
                            <div>
                                <up-outlined
                                    :style="'transition-duration:0.5s;' + (collapseClass === 'collapse' ? '' : 'transform: rotate(180deg);')">
                                </up-outlined>
                            </div>
                        </div>
                    </div>
                    <div :class="collapseClass">
                        <div @click="navigationFunc('/StatisticsManagement')">
                            数据可视化
                        </div>
                        <div class="divider"></div>
                        <div @click="navigationFunc('AlertConsole')">
                            报警信息
                        </div>
                        <div class="divider"></div>
                        <div @click="navigationFunc('PlantRecommend')">
                            种植推荐
                        </div>
                    </div>
                </div>
                <div @click="navigationFunc('ShoppingCenter')">
                    <svg xmlns="http://www.w3.org/2000/svg"
                        class="styles__StyledSVGIconPathComponent-sc-16fsqc8-0 fPsHiw svg-icon-path-icon fill"
                        viewBox="0 0 1024 1024" width="30" height="30">
                        <defs data-reactroot=""></defs>
                        <g>
                            <path
                                d="M825.6 554.666667c-64 0-121.6-38.4-155.733333-89.6C633.6 516.266667 576 554.666667 512 554.666667s-121.6-38.4-155.733333-89.6C320 516.266667 264.533333 554.666667 198.4 554.666667 89.6 554.666667 0 465.066667 0 356.266667v-8.533334L151.466667 0h721.066666L1024 345.6v8.533333c0 110.933333-89.6 200.533333-198.4 200.533334z m-200.533333-219.733334h85.333333c0 61.866667 51.2 134.4 113.066667 134.4 59.733333 0 108.8-46.933333 113.066666-104.533333L817.066667 85.333333H206.933333L85.333333 364.8c4.266667 57.6 53.333333 104.533333 113.066667 104.533333 64 0 113.066667-74.666667 113.066667-134.4h85.333333c0 61.866667 51.2 134.4 113.066667 134.4 66.133333 0 115.2-74.666667 115.2-134.4zM810.666667 1021.866667H213.333333c-83.2 0-149.333333-64-149.333333-142.933334V595.2h85.333333v283.733333c0 32 27.733333 57.6 64 57.6h597.333334c34.133333 0 64-25.6 64-57.6V595.2h85.333333v283.733333c0 78.933333-66.133333 142.933333-149.333333 142.933334z"
                                p-id="4751" fill="#ffffff"></path>
                        </g>
                    </svg>
                    商城
                </div>
            </template>
            <template v-if="role=='material'">
                <div @click="navigationFunc('TraceMaterial')" style="margin-top:120px">
                    <svg xmlns="http://www.w3.org/2000/svg"
                        class="styles__StyledSVGIconPathComponent-sc-16fsqc8-0 fPsHiw svg-icon-path-icon"
                        viewBox="0 0 1024 1024" width="30" height="30">
                        <defs data-reactroot=""></defs>
                        <g>
                            <path
                                d="M384 547.2H128a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64z m-21.333333 298.666667H149.333333v-213.333334h213.333334zM384 56.533333H128a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64z m-21.333333 298.666667H149.333333v-213.333333h213.333334zM597.333333 440.533333h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64H597.333333a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64z m21.333334-298.666666h213.333333v213.333333H618.666667zM727.466667 845.866667H618.666667v-213.333334h213.333333v107.733334a10.666667 10.666667 0 0 0 10.666667 10.666666h64a10.666667 10.666667 0 0 0 10.666666-10.666666v-133.973334a59.093333 59.093333 0 0 0-59.306666-59.093333h-264.533334A59.306667 59.306667 0 0 0 533.333333 606.293333v265.6a59.52 59.52 0 0 0 59.306667 59.306667h134.826667a10.666667 10.666667 0 0 0 10.666666-10.666667v-64a10.666667 10.666667 0 0 0-10.666666-10.666666z"
                                fill="#ffffff" p-id="1777"></path>
                            <path
                                d="M817.28 769.92a10.666667 10.666667 0 0 0-15.146667 0l-45.226666 45.226667a10.666667 10.666667 0 0 0 0 14.933333l134.4 134.4a10.666667 10.666667 0 0 0 14.933333 0L960 911.573333z"
                                fill="#ffffff" p-id="1778"></path>
                        </g>
                    </svg>
                    <div>
                        原料管理
                    </div>
                </div>
            </template>
            <template v-if="role=='product'">
                <div @click="navigationFunc('TraceManufactor')" style="margin-top:120px">
                    <svg xmlns="http://www.w3.org/2000/svg"
                        class="styles__StyledSVGIconPathComponent-sc-16fsqc8-0 fPsHiw svg-icon-path-icon"
                        viewBox="0 0 1024 1024" width="30" height="30">
                        <defs data-reactroot=""></defs>
                        <g>
                            <path
                                d="M384 547.2H128a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64z m-21.333333 298.666667H149.333333v-213.333334h213.333334zM384 56.533333H128a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64z m-21.333333 298.666667H149.333333v-213.333333h213.333334zM597.333333 440.533333h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64H597.333333a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64z m21.333334-298.666666h213.333333v213.333333H618.666667zM727.466667 845.866667H618.666667v-213.333334h213.333333v107.733334a10.666667 10.666667 0 0 0 10.666667 10.666666h64a10.666667 10.666667 0 0 0 10.666666-10.666666v-133.973334a59.093333 59.093333 0 0 0-59.306666-59.093333h-264.533334A59.306667 59.306667 0 0 0 533.333333 606.293333v265.6a59.52 59.52 0 0 0 59.306667 59.306667h134.826667a10.666667 10.666667 0 0 0 10.666666-10.666667v-64a10.666667 10.666667 0 0 0-10.666666-10.666666z"
                                fill="#ffffff" p-id="1777"></path>
                            <path
                                d="M817.28 769.92a10.666667 10.666667 0 0 0-15.146667 0l-45.226666 45.226667a10.666667 10.666667 0 0 0 0 14.933333l134.4 134.4a10.666667 10.666667 0 0 0 14.933333 0L960 911.573333z"
                                fill="#ffffff" p-id="1778"></path>
                        </g>
                    </svg>
                    <div>
                        产品加工
                    </div>
                </div>
            </template>
            <template v-if="role=='driver'">
                <div @click="navigationFunc('TraceDriver')" style="margin-top:120px">
                    <svg xmlns="http://www.w3.org/2000/svg"
                        class="styles__StyledSVGIconPathComponent-sc-16fsqc8-0 fPsHiw svg-icon-path-icon"
                        viewBox="0 0 1024 1024" width="30" height="30">
                        <defs data-reactroot=""></defs>
                        <g>
                            <path
                                d="M384 547.2H128a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64z m-21.333333 298.666667H149.333333v-213.333334h213.333334zM384 56.533333H128a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64z m-21.333333 298.666667H149.333333v-213.333333h213.333334zM597.333333 440.533333h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64H597.333333a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64z m21.333334-298.666666h213.333333v213.333333H618.666667zM727.466667 845.866667H618.666667v-213.333334h213.333333v107.733334a10.666667 10.666667 0 0 0 10.666667 10.666666h64a10.666667 10.666667 0 0 0 10.666666-10.666666v-133.973334a59.093333 59.093333 0 0 0-59.306666-59.093333h-264.533334A59.306667 59.306667 0 0 0 533.333333 606.293333v265.6a59.52 59.52 0 0 0 59.306667 59.306667h134.826667a10.666667 10.666667 0 0 0 10.666666-10.666667v-64a10.666667 10.666667 0 0 0-10.666666-10.666666z"
                                fill="#ffffff" p-id="1777"></path>
                            <path
                                d="M817.28 769.92a10.666667 10.666667 0 0 0-15.146667 0l-45.226666 45.226667a10.666667 10.666667 0 0 0 0 14.933333l134.4 134.4a10.666667 10.666667 0 0 0 14.933333 0L960 911.573333z"
                                fill="#ffffff" p-id="1778"></path>
                        </g>
                    </svg>
                    <div>
                        物流管理
                    </div>
                </div>
            </template>
            <template v-if="role=='retailer'">
                <div @click="navigationFunc('TraceRetailer')" style="margin-top:120px">
                    <svg xmlns="http://www.w3.org/2000/svg"
                        class="styles__StyledSVGIconPathComponent-sc-16fsqc8-0 fPsHiw svg-icon-path-icon"
                        viewBox="0 0 1024 1024" width="30" height="30">
                        <defs data-reactroot=""></defs>
                        <g>
                            <path
                                d="M384 547.2H128a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64z m-21.333333 298.666667H149.333333v-213.333334h213.333334zM384 56.533333H128a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64z m-21.333333 298.666667H149.333333v-213.333333h213.333334zM597.333333 440.533333h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64H597.333333a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64z m21.333334-298.666666h213.333333v213.333333H618.666667zM727.466667 845.866667H618.666667v-213.333334h213.333333v107.733334a10.666667 10.666667 0 0 0 10.666667 10.666666h64a10.666667 10.666667 0 0 0 10.666666-10.666666v-133.973334a59.093333 59.093333 0 0 0-59.306666-59.093333h-264.533334A59.306667 59.306667 0 0 0 533.333333 606.293333v265.6a59.52 59.52 0 0 0 59.306667 59.306667h134.826667a10.666667 10.666667 0 0 0 10.666666-10.666667v-64a10.666667 10.666667 0 0 0-10.666666-10.666666z"
                                fill="#ffffff" p-id="1777"></path>
                            <path
                                d="M817.28 769.92a10.666667 10.666667 0 0 0-15.146667 0l-45.226666 45.226667a10.666667 10.666667 0 0 0 0 14.933333l134.4 134.4a10.666667 10.666667 0 0 0 14.933333 0L960 911.573333z"
                                fill="#ffffff" p-id="1778"></path>
                        </g>
                    </svg>
                    <div>
                        产品管理
                    </div>
                </div>
                <div @click="navigationFunc('RetailerManagement')">
                    <svg xmlns="http://www.w3.org/2000/svg"
                        class="styles__StyledSVGIconPathComponent-sc-16fsqc8-0 fPsHiw svg-icon-path-icon"
                        viewBox="0 0 1024 1024" width="30" height="30">
                        <defs data-reactroot=""></defs>
                        <g>
                            <path
                                d="M384 547.2H128a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64z m-21.333333 298.666667H149.333333v-213.333334h213.333334zM384 56.533333H128a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64z m-21.333333 298.666667H149.333333v-213.333333h213.333334zM597.333333 440.533333h256a64 64 0 0 0 64-64v-256a64 64 0 0 0-64-64H597.333333a64 64 0 0 0-64 64v256a64 64 0 0 0 64 64z m21.333334-298.666666h213.333333v213.333333H618.666667zM727.466667 845.866667H618.666667v-213.333334h213.333333v107.733334a10.666667 10.666667 0 0 0 10.666667 10.666666h64a10.666667 10.666667 0 0 0 10.666666-10.666666v-133.973334a59.093333 59.093333 0 0 0-59.306666-59.093333h-264.533334A59.306667 59.306667 0 0 0 533.333333 606.293333v265.6a59.52 59.52 0 0 0 59.306667 59.306667h134.826667a10.666667 10.666667 0 0 0 10.666666-10.666667v-64a10.666667 10.666667 0 0 0-10.666666-10.666666z"
                                fill="#ffffff" p-id="1777"></path>
                            <path
                                d="M817.28 769.92a10.666667 10.666667 0 0 0-15.146667 0l-45.226666 45.226667a10.666667 10.666667 0 0 0 0 14.933333l134.4 134.4a10.666667 10.666667 0 0 0 14.933333 0L960 911.573333z"
                                fill="#ffffff" p-id="1778"></path>
                        </g>
                    </svg>
                    <div>
                        订单管理
                    </div>
                </div>
            </template>
            <div @click="()=>router.push('/')">
                <svg xmlns="http://www.w3.org/2000/svg"
                    class="styles__StyledSVGIconPathComponent-sc-16fsqc8-0 fPsHiw svg-icon-path-icon fill"
                    viewBox="0 0 32 32" width="30" height="30">
                    <defs data-reactroot=""></defs>
                    <g>
                        <path
                            d="M6.667 29.333c-0.736 0-1.333-0.597-1.333-1.333v0-24c0-0.736 0.597-1.333 1.333-1.333v0h18.667c0.736 0 1.333 0.597 1.333 1.333v0 4h-2.667v-2.667h-16v21.333h16v-2.667h2.667v4c0 0.736-0.597 1.333-1.333 1.333v0h-18.667zM24 21.333v-4h-9.333v-2.667h9.333v-4l6.667 5.333-6.667 5.333z">
                        </path>
                    </g>
                </svg>
                退出
            </div>
        </div>
        <div id="viewContainer">
            <router-view></router-view>
        </div>
    </div>
</template>
<script lang="ts" setup>
import { ref } from 'vue';
import { useRouter } from 'vue-router';
import { UpOutlined } from '@ant-design/icons-vue';
const router = useRouter();
const navigationFunc = (to: string) => {
    router.push(to)
}
const collapseClass = ref('collapse');
const toggleCollapse = () => {
    collapseClass.value === 'collapse' ? collapseClass.value = 'collapse end' : collapseClass.value = 'collapse';
}
const role = ref('farmer');
const roleNow = localStorage.getItem('role');
role.value = typeof (roleNow) === 'string' ? roleNow : 'farmer'

</script>
<style lang="less" scoped>
#dashBoard {
    display: flex;
    flex-direction: row;
    min-height: calc(100vh - 64px)
}

#navigationSider {
    z-index: 1;
    color: #fff;
    background: rgb(var(--green-6));
    border-radius: 0 100px 0 0;
    min-width: 160px;
    margin-right: 8px;
    display: flex;
    flex-direction: column;
    -webkit-user-select: none;
    -moz-user-select: none;
    user-select: none
}

#navigationSider .item,
#navigationSider>div {
    display: flex;
    align-items: center;
    font-size: 18px;
    padding-left: 12px;
    margin-bottom: 76px;
    cursor: pointer
}

#navigationSider .item svg,
#navigationSider>div svg {
    margin: 8px;
    fill: #fff
}

#navigationSider>.container {
    flex-direction: column;
    padding: 0
}

#navigationSider>div :last-child {
    margin-top: auto
}

#viewContainer {
    width: calc(100% - 180px)
}

.collapse {
    transition-duration: .5s;
    transition-timing-function: ease-in-out;
    height: 0;
    overflow: hidden;
    background-color: #0c7612;
    width: 100%;
    padding-left: 36px
}

.collapse>div {
    margin-bottom: 12px
}

.collapse.end {
    height: 160px;
    padding: 18px 0 0 36px
}

.divider {
    height: 1px;
    margin: 4px 0;
    background-color: #fff
}
</style>