<template>
    <div class="envCardContainer">
        <a-modal v-model:visible="visible" title="预测结果">
            <template #footer>
            </template>
            <div>
                含氮量：{{envData.NPotency}}%，含磷量：{{envData.PPotency}}%，含钾量：{{envData.KPotency}}%，土壤温度：{{envData.SoilTemp}}℃，土壤湿度：{{envData.SoilHumidity}}%，PH值：{{envData.pH}}，您在该环境下种植<em
                    style="font-size: large;font-weight: 600;">{{curRecommend}}</em>作物产量将为最大。
            </div>
        </a-modal>
        <div>
            种植推荐—最大产量作物预测（自定义环境数值）
        </div>
        <div>
            <div>
                <div class="textIcon">
                    <div>
                        N
                    </div>
                </div>
                <div>含氮量</div>
            </div>
            <div>
                <a-input placeholder="请输入..." v-model:value="envData.NPotency"></a-input>
                <div>
                    %
                </div>
            </div>
        </div>
        <div>
            <div>
                <div class="textIcon">
                    <div>
                        P
                    </div>
                </div>
                <div>含磷量</div>
            </div>
            <div>
                <a-input placeholder="请输入..." v-model:value="envData.PPotency"></a-input>
                <div>
                    %
                </div>
            </div>
        </div>
        <div>
            <div>
                <div class="textIcon">
                    <div>
                        K
                    </div>
                </div>
                <div>含钾量</div>
            </div>
            <div>
                <a-input placeholder="请输入..." v-model:value="envData.KPotency"></a-input>
                <div>
                    %
                </div>
            </div>
        </div>
        <div>
            <div>
                <svg xmlns="http://www.w3.org/2000/svg"
                    class="styles__StyledSVGIconPathComponent-sc-16fsqc8-0 fPsHiw svg-icon-path-icon"
                    viewBox="0 0 1024 1024" width="40" height="40">
                    <defs data-reactroot=""></defs>
                    <g>
                        <path
                            d="M691.6 231.4H655c-10.9 0-19.8-8.9-19.8-19.8s8.9-19.8 19.8-19.8h36.6c10.9 0 19.8 8.9 19.8 19.8s-8.9 19.8-19.8 19.8zM691.6 305.7H655c-10.9 0-19.8-8.9-19.8-19.8s8.9-19.8 19.8-19.8h36.6c10.9 0 19.8 8.9 19.8 19.8s-8.9 19.8-19.8 19.8zM691.6 380H655c-10.9 0-19.8-8.9-19.8-19.8s8.9-19.8 19.8-19.8h36.6c10.9 0 19.8 8.9 19.8 19.8 0 10.8-8.9 19.8-19.8 19.8z"
                            fill="#1A1A1A" p-id="8435"></path>
                        <path
                            d="M603.3 589.7V159.5c0-51.9-42.2-94.1-94.1-94.1-51.9 0-94.1 42.2-94.1 94.1v430.2c-61 33.4-102.4 98.2-102.4 172.5 0 108.4 88.2 196.5 196.5 196.5s196.5-88.2 196.5-196.5c0-74.3-41.5-139.1-102.4-172.5z m-94.2 327.7c-85.6 0-155.3-69.7-155.3-155.3 0-50.3 24-95 61.2-123.4 12.4-9.5 26.3-17.2 41.2-22.6V159.5c0-29.2 23.7-52.9 52.9-52.9s52.9 23.7 52.9 52.9V616.1c14.9 5.4 28.8 13.1 41.2 22.6 37.1 28.4 61.2 73.1 61.2 123.4 0 85.7-69.6 155.3-155.3 155.3z"
                            fill="#1A1A1A" p-id="8436"></path>
                        <path d="M509.4 766.5m-83.3 0a83.3 83.3 0 1 0 166.6 0 83.3 83.3 0 1 0-166.6 0Z" fill="#00B36A"
                            p-id="8437"></path>
                        <path
                            d="M613.3 767.2c-9.5-1.8-18.7 3.7-21.7 12.7-6.4 39.6-40.8 69.9-82.2 69.9-46 0-83.3-37.3-83.3-83.3s37.3-83.3 83.3-83.3c6.7 0 13.2 0.8 19.4 2.3 0.1-0.8 0.2-1.6 0.2-2.3V207.7c0-10.5-8.6-19-19-19-10.5 0-19 8.6-19 19v440.1c-0.9 0-1.9 0.1-2.8 0.3-49 9.1-86.8 46.6-96.3 95.5-12.7 65.2 30.1 128.6 95.3 141.2 7.7 1.5 15.4 2.2 23 2.2 56.5 0 107.1-40 118.2-97.5 1.9-10.3-4.8-20.3-15.1-22.3z"
                            fill="#1A1A1A" p-id="8438"></path>
                    </g>
                </svg>
                <div>土壤温度</div>
            </div>
            <div>
                <a-input placeholder="请输入..." v-model:value="envData.SoilTemp"></a-input>
                <div>
                    °C
                </div>
            </div>
        </div>
        <div>
            <div>
                <svg xmlns="http://www.w3.org/2000/svg"
                    class="styles__StyledSVGIconPathComponent-sc-16fsqc8-0 fPsHiw svg-icon-path-icon"
                    viewBox="0 0 1024 1024" width="35" height="35">
                    <defs data-reactroot=""></defs>
                    <g>
                        <path
                            d="M339.7 882.5C196.6 882.5 80.2 766.1 80.2 623c0-133.2 204.8-395.1 228.2-424.5 5.8-7.3 14.5-11.6 23.8-11.7 9.4-0.1 18.1 3.9 24.1 11 1.5 1.8 37.7 44.8 82.2 105.2 10.1 13.8 7.2 33.2-6.6 43.3-13.8 10.1-33.2 7.2-43.3-6.6-21.3-29-40.9-54-55.3-72.1-69.2 92-191.2 271.5-191.2 355.4 0 108.9 88.6 197.6 197.6 197.6S537.3 731.9 537.3 623c0-17.1 13.9-31 31-31s31 13.9 31 31c-0.1 143.1-116.5 259.5-259.6 259.5z"
                            fill="#1A1A1A" p-id="7534"></path>
                        <path
                            d="M363.7 468.8c-27.9 59.7-46.8 115.7-46.8 158.4 0 164.6 133.4 298 298 298s298-133.4 298-298c0-12.8-1.9-26.9-5.5-41.9-327.2 33.9-284.9-194.9-543.7-116.5z"
                            fill="#00B36A" p-id="7535"></path>
                        <path
                            d="M333.6 567.6c-38.2 239.9 123 357.7 287.3 357.7 92.8 0 144.9-12.1 199.6-78.6-261.5 20.7-428.7-99.2-486.9-279.1z"
                            fill="#009957" p-id="7536"></path>
                        <path
                            d="M614.9 956.1C433.5 956.1 286 808.5 286 627.2c0-173.4 283.4-532.4 295.5-547.6 5.8-7.3 14.5-11.6 23.8-11.7 9.3-0.1 18.1 3.9 24.1 11 2 2.3 49 58.2 106.8 136.6 10.1 13.8 7.2 33.2-6.6 43.3-13.8 10.1-33.2 7.2-43.3-6.6-31.8-43.2-60.6-79.8-79.9-103.7C517 266.1 347.9 512.3 347.9 627.2c0 147.2 119.8 267 267 267s267-119.8 267-267c0-29.7-13.2-87.9-76.4-196.2-8.6-14.8-3.6-33.7 11.2-42.3 14.8-8.6 33.7-3.6 42.3 11.2 57.1 97.9 84.8 172.2 84.8 227.4 0 181.3-147.6 328.8-328.9 328.8z"
                            fill="#1A1A1A" p-id="7537"></path>
                    </g>
                </svg>
                <div>土壤湿度</div>
            </div>
            <div>
                <a-input placeholder="请输入..." v-model:value="envData.SoilHumidity"></a-input>
                <div>
                    %
                </div>
            </div>
        </div>
        <div>
            <div>
                <svg xmlns="http://www.w3.org/2000/svg"
                    class="styles__StyledSVGIconPathComponent-sc-16fsqc8-0 fPsHiw svg-icon-path-icon"
                    viewBox="0 0 1024 1024" width="37" height="37">
                    <defs data-reactroot=""></defs>
                    <g>
                        <path
                            d="M512 512m-477.866667 0a477.866667 477.866667 0 1 0 955.733334 0 477.866667 477.866667 0 1 0-955.733334 0Z"
                            fill="#2FAF48" p-id="11572" data-spm-anchor-id="a313x.7781069.0.i22" class="selected">
                        </path>
                        <path
                            d="M883.370667 665.6c-6.144-2.730667-12.970667-5.461333-20.48-8.874667-81.237333-25.941333-86.698667 49.834667-194.56 21.162667-49.834667-12.970667-77.824-17.066667-96.938667-16.384-13.653333 4.778667-28.672 8.192-43.008 9.557333-0.682667 0-2.048 0-2.730667 0.682667h-0.682666-1.365334c-0.682667 0-42.325333 12.288-42.325333 12.288-34.816 5.461333-90.112 8.192-189.098667-0.682667-81.237333-6.826667-73.728-44.373333-137.898666-22.528v12.288c0.682667 1.365333 1.365333 2.730667 2.048 4.778667 2.048 3.413333 3.413333 6.826667 5.461333 10.922667 0 0.682667 0.682667 1.365333 1.365333 2.048l12.288 20.48c0.682667 1.365333 1.365333 2.048 2.048 3.413333 2.048 3.413333 4.096 6.144 6.144 9.557333 0.682667 1.365333 2.048 2.730667 2.730667 4.096 6.826667 10.24 14.336 19.797333 22.528 28.672l4.096 4.778667 6.826667 8.192c1.365333 1.365333 2.730667 3.413333 4.778666 4.778667 4.096 4.096 8.192 8.874667 12.288 12.288 1.365333 2.048 3.413333 3.413333 5.461334 5.461333 2.048 2.048 4.778667 4.778667 6.826666 6.144 2.048 2.048 4.096 3.413333 5.461334 5.461333l6.826666 6.144c2.730667 2.048 5.461333 4.778667 8.192 6.144l9.557334 7.509334c2.730667 2.048 5.461333 4.096 8.192 5.461333l6.826666 4.778667c2.730667 2.048 5.461333 3.413333 8.192 5.461333l6.144 4.096c4.778667 2.730667 8.874667 5.461333 13.653334 8.192 2.048 0.682667 4.096 2.048 6.144 3.413333 2.048 1.365333 6.144 3.413333 10.24 5.461334l6.144 3.413333c4.096 2.048 8.192 4.096 12.288 5.461333l4.096 2.048c5.461333 2.048 10.24 4.096 15.018666 6.144 2.048 0.682667 4.096 1.365333 5.461334 2.048l11.605333 4.096 5.461333 1.365334 16.384 4.778666 3.413334 0.682667c4.778667 1.365333 9.557333 2.048 14.336 3.413333l5.461333 0.682667c4.778667 0.682667 9.557333 2.048 14.336 2.730667 1.365333 0 2.730667 0 4.096 0.682666 6.144 0.682667 11.605333 2.048 17.749333 2.730667h4.778667c4.778667 0 9.557333 0.682667 14.336 0.682667h48.469333l15.018667-0.682667h4.096c6.144-0.682667 12.288-1.365333 17.749333-2.730667 1.365333 0 2.730667 0 4.096-0.682666 4.778667-0.682667 9.557333-1.365333 14.336-2.730667l5.461334-0.682667 16.384-4.096h0.682666l17.749334-4.778666 5.461333-1.365334c4.096-1.365333 8.192-2.730667 12.288-4.778666 1.365333-0.682667 3.413333-1.365333 4.778667-1.365334 5.461333-2.048 10.922667-4.096 15.701333-6.144 1.365333-0.682667 3.413333-1.365333 4.778667-2.048 4.096-2.048 8.192-3.413333 11.605333-5.461333 2.048-0.682667 4.096-2.048 5.461333-2.730667l12.970667-6.826666 4.096-2.048 12.970667-8.192c2.048-0.682667 4.096-2.730667 5.461333-3.413334 3.413333-2.048 6.144-4.096 9.557333-6.144 2.048-1.365333 3.413333-2.730667 5.461334-3.413333 4.778667-3.413333 8.874667-6.144 12.970666-9.557333 2.048-1.365333 3.413333-2.730667 5.461334-4.096 2.730667-2.048 5.461333-4.778667 8.192-6.826667l5.461333-4.778667c2.730667-2.730667 5.461333-4.778667 8.874667-7.509333l6.826666-6.826667c2.048-2.048 5.461333-5.461333 8.874667-8.192s4.096-4.096 5.461333-5.461333l6.144-6.826667c1.365333-2.048 3.413333-4.096 5.461334-5.461333 3.413333-4.096 6.826667-8.192 9.557333-11.605333 2.048-2.048 3.413333-4.096 5.461333-6.144 2.048-2.048 4.096-4.778667 5.461334-6.826667 2.048-2.048 3.413333-4.778667 5.461333-6.826667 2.048-2.048 3.413333-5.461333 5.461333-7.509333l7.509334-10.922667c2.048-2.730667 3.413333-5.461333 5.461333-8.192s3.413333-5.461333 4.778667-8.192l4.096-7.509333 4.096-8.192 6.826666-13.653333-2.730666-4.778667zM509.269333 634.88c141.312 0 256-115.370667 256-256.682667S649.898667 121.514667 508.586667 121.514667C367.274667 121.514667 252.586667 236.202667 252.586667 378.197333 252.586667 519.509333 367.274667 634.197333 509.269333 634.88z m0-468.992c126.293333 0 211.626667 85.333333 211.626667 212.309333s-85.333333 211.626667-211.626667 211.626667-211.626667-85.333333-211.626666-211.626667 84.650667-211.626667 211.626666-212.309333z m34.816 219.136h66.901334v70.997333h24.576v-157.013333h-24.576v64.170667h-67.584v-64.170667H518.826667v157.013333h24.576V385.024z m-137.898666 11.605333H430.08c34.133333 0 59.392-15.701333 59.392-49.834666s-25.258667-47.786667-60.074667-47.786667h-47.786666v157.013333h24.576v-59.392z m0-77.141333h20.48c25.258667 0 38.229333 6.826667 38.229333 27.989333 0 21.162667-11.605333 30.037333-37.546667 30.037334h-21.162666v-58.026667z"
                            fill="#FFFFFF" p-id="11573"></path>
                    </g>
                </svg>
                <div>土壤pH值</div>
            </div>
            <div>
                <a-input placeholder="请输入..." v-model:value="envData.pH"></a-input>
            </div>
        </div>
        <div>
            <div>
                <green-button @click="getRecommend">
                    提交
                </green-button>
            </div>
        </div>
    </div>
</template>
<script lang="ts" setup>
import GreenButton from '@/components/GreenButton.vue';
import apis from '@/tools/apis';
import { message } from 'ant-design-vue';
import { ref } from 'vue';
export type envDataClassification = 'NPotency' | 'PPotency' | 'KPotency' | 'SoilTemp' | 'SoilHumidity' | 'pH';
export type envDataType = {
    [index in envDataClassification]: number;
}

const visible = ref(false)

const envData = ref<envDataType>({
    NPotency: 10,
    PPotency: 10,
    KPotency: 10,
    SoilHumidity: 10,
    SoilTemp: 10,
    pH: 10
})
const curRecommend = ref('获取中...')
const key = 'recommend'
const getRecommend = async () => {
    message.loading({ content: '获取推荐中...', key })
    const recommendValue=await apis.recommend({
        N: envData.value.NPotency,
        P: envData.value.PPotency,
        K: envData.value.KPotency,
        temperature: envData.value.SoilTemp,
        humidity: envData.value.SoilHumidity,
        ph: envData.value.pH,
    })
    if (recommendValue.status==='success'){
        curRecommend.value = recommendValue.data.message
        console.log(curRecommend.value)
        visible.value = true
    }
    else if(recommendValue.status=='false'){
        message.error(recommendValue.message)
    }
    message.destroy(key)
}
</script>
<style lang="less" scoped>
.envCardContainer {
    width: 100%;
    height: 100%;
    display: flex;
    flex-direction: row;
    flex-wrap: wrap;
    padding: 50px 150px;



    >div {
        display: flex;
        flex-direction: column;
        width: 50%;
        padding: 48px;
        font-size: 24px;
        font-weight: 600;

        >div:first-child {
            display: flex;
            justify-content: left;
            margin-top: 8px;
            align-items: center;
        }

        >div:nth-child(2) {
            margin-top: 16px;
            max-width: 400px;
            position: relative;

            >*:nth-child(2) {
                position: absolute;
                right: -64px;
                bottom: 0;
            }
        }
    }

    .textIcon {

        width: 33px;
        height: 33px;
        border-width: 0px;
        border-style: none;
        border-color: unset;
        font-size: 14px;
        padding: 0px;
        text-align: center;
        line-height: 20px;
        font-weight: normal;
        font-style: normal;
        background: rgb(47, 175, 72);
        align-items: center;
        justify-content: center;
        border-radius: 100%;
        display: flex;

        >div {
            font-weight: 600;
            color: #fff;
            font-size: 16px;
        }
    }

    >div:first-child,
    >div:last-child {
        width: 100%;
    }

    >div:last-child {
        width: 100%;
        display: flex;

        >div {
            margin: auto;
            width: 120px;
        }
    }
}
</style>